Repository: 84000/data-translation-memory
Catalog: toh163-v2.tmx
Source language: bo
Languages: en

source: དེ་ཡི་རྗེས་ལ་ལྷ་རྣམས་ཀྱིས། །སྒྲ་སྐད་ཆེན་པོ་ཕྱུང་གྱུར་ཅིང་། །ལྷ་ཡི་མེ་ཏོག་ཀུ་སུ་མ། །ཡིད་འོང་གཏོར་ཅིང་ཞིང་འདི་བཀང་། །
en: After this, the gods Made a loud cry And scattered pleasing divine flowers, Filling the realm.

source: ལྷ་རྣམས་མཁའ་ལ་འདུག་ནས་སུ། །གླུ་དབྱངས་དཔག་ཏུ་མེད་པ་ལེན། །
en: The gods, having remained in the sky, Then sang countless songs.

source: ཚངས་པ་དག་ནི་བྱེ་བ་ཡིས། །ཙན་དན་དམར་པོའི་ཆར་ཕབ་པོ། །
en: Millions of brahmā gods Cast down a rain of red sandalwood powder.

source: དེ་བཞིན་གཤེགས་པས་མདོ་སྡེ་འདི། །གསུངས་ཚེ་དྲ་བ་ཅན་ཐོས་ཏེ། །
en: When Ratnajālin heard this discourse Spoken by the Thus-Gone One,

source: སེམས་ནི་རངས་ཤིང་ཡིད་དགའ་ནས། །དེ་བཞིན་གཤེགས་ལ་ཚིག་གསོལ་བ། །
en: He was pleased and delighted, And spoke these words to the Thus-Gone One:

source: ཕྱི་མའི་དུས་སུ་བདག་གིས་ནི། །དགེ་སློང་བགྱིས་ལ་མི་འཇིགས་པར། །གྲོང་དང་གྲོང་ཁྱེར་རྣམས་དག་ཏུ། །མདོ་སྡེ་འདི་ནི་བཤད་པར་བགྱི། །
en: “In the future, I will become a monk And fearlessly preach this discourse In towns and villages.

source: སངས་རྒྱས་བཀའ་བཞིན་བདག་བགྱིད་དེ། །རྫོགས་སངས་རྒྱས་ལ་དཔལ་གྱིས་གསུངས། །
en: “I will act according to the Buddha’s teaching, Which the perfect Buddha has spoken so gloriously.

source: དཔག་ཚད་བྱེ་བར་མཆིས་ནས་སུ། །འདི་ཡི་ཚུལ་ནི་བཤད་པར་བགྱི། །
en: Traveling millions of leagues I will preach the way.

source: ལྷ་ཀུན་དང་ནི་ཀླུ་རྣམས་དང་། །ཡང་ན་མིའམ་ཅི་དང་ནི། །མི་མ་ཡིན་རྣམས་མགྲོན་གཉེར་ཏེ། །ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་བགྱི། །
en: “I will serve all the gods, nāgas, And kinnaras, And other non-human beings, Satisfying them with the gift of Dharma.”

source: བླ་ན་མེད་པའི་མདོ་སྡེ་འདི། །སངས་རྒྱས་ཀྱིས་ནི་གསུངས་པ་ན། །ལྷ་མ་ཡིན་ཚོགས་དགའ་གྱུར་ནས། །མེ་ཏོག་དཔག་ཏུ་མེད་པ་འཐོར། །
en: When this unsurpassed discourse Was taught by the Buddha, The assembly of asuras celebrated And scattered countless flowers.

source: སངས་རྒྱས་ཀྱི་ནི་ཞིང་འདི་དག །མི་མཆོག་ཤཱཀྱ་སེང་གེ་ཡི། །ཆོས་ཀྱི་རྒྱལ་པོའི་སྤུ་གཅིག་གིས། །ཞིང་རྣམས་ཐམས་ཅད་སྣང་བར་མཛད། །
en: A single hair of the Dharma King, The Lion of the Śākyas, Who is the supreme being in all buddha realms, Illuminated all the realms.

source: སེམས་ཅན་སྙིང་པོའི་བདག་ཉིད་ཅན། །སྟོན་པ་ཡི་ནི་ལྗགས་ཕྱུང་ནས། །གང་གཱའི་བྱེ་མ་སྙེད་དག་གི། །ཞིང་རྣམས་བྱེ་བ་ཁེབས་པར་མཛད། །
en: Then, the tongue of the Teacher, The great being, the essential being, Emerged and covered millions of realms As numerous as the grains of sand in the Ganges.

source: དེ་བཞིན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི། །ཞིང་རྣམས་བྱེ་བ་ཁེབས་མཛད་དེ། །གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན། །དཔའ་བོ་དང་ནི་ལིཙྪ་བཱི། །བྱེ་བ་དྲུག་ཅུ་ཙམ་དག་ནི། །ལྷན་ཅིག་ལྷགས་ལ་བཀའ་སྩོལ་ཅིག །
en: As the Thus-Gone One covered millions of realms Throughout the ten directions of the universe, The youth Ratnajālin, As well as other heroes and Licchavis Numbering six hundred million, Arrived saying, “Please teach us!”

source: དེ་ནས་དེར་ནི་སྟོན་པ་ཡིས། །དེ་དག་ཆོས་ལ་གཟུད་པར་མཛད། །
en: The Teacher then introduced The Dharma to them all.

source: བདེ་བ་ཐམས་ཅད་སྦྱིན་མཛད་པ། །སངས་རྒྱས་སྤྱན་ནི་ཐོགས་པ་མེད། །
en: The buddhas gift every form of happiness, And their eyes are unimpeded.

source: དེ་བཞིན་གཤེགས་རྣམས་དཔག་མེད་དེ། །སངས་རྒྱས་ཆོས་ལ་ཐེ་ཚོམ་སྤོང་། །
en: The countless thus-gone ones Have abandoned doubt about awakened qualities.

source: སངས་རྒྱས་ཡེ་ཤེས་ཐོགས་མེད་དེ། །དུས་གསུམ་རྣམས་ལའང་འཇུག་པར་མཛད། །
en: The buddhas’ wisdom is unimpeded— It perceives the three times.

source: ཆོས་རྣམས་ཀུན་ལ་མངའ་བརྙེས་པས། །སངས་རྒྱས་ལ་ནི་མི་མཁྱེན་མེད། །
en: Given that they have dominion over all phenomena, There is nothing unknown to the buddhas.

source: ཕུང་པོ་རྣམས་ནི་མེད་པའོ་ཞེས། །མི་ཡི་འདྲེན་པ་སྟོན་པར་མཛད། །
en: The Guide of Humans preaches That the aggregates are nonexistent.

source: ཁམས་བཞི་དག་ནི་གསོག་དང་འདྲ། །གང་དུའང་སྒྲ་ལ་ཆགས་པ་མེད། །
en: The four elements are as if hollow, And nowhere are there sounds to be attached to.

source: གཟུགས་དང་ཚོར་བ་འདུ་ཤེས་དང་། །སེམས་པ་དང་ནི་འདུ་བྱེད་དང་། །རྣམ་ཤེས་ཕུང་པོའི་སྙིང་པོ་ནི། །མེད་པ་དག་ཏུ་ཤེས་པར་གྱིས། །
en: The essence of the aggregates Of form, feeling, perception, Thoughts, formations, and consciousness Should be known to be nonexistent.

source: སངས་རྒྱས་ཀྱིས་ནི་གསུངས་པ་བཞིན། །དེ་ལྟར་ཕུང་པོ་རྣམས་ཕྱེ་ནམྱུར་དུ་གཟུངས་རྣམས་འཐོབ་འགྱུར་ཞིང་། །ཤིན་ཏུ་རྨོངས་པ་མེད་པར་འགྱུར། །
en: Just as the Buddha has taught, If one distinguishes the aggregates, One will swiftly attain the dhāraṇīs And become undeluded.

source: ཆོས་རྣམས་དག་ནི་གསོབ་དང་འདྲ། །ཐམས་ཅད་སྟོང་ཞིང་བདག་མེད་དོ། །
en: All phenomena are void— All of them are empty and without self.

source: རྩོད་པ་མེད་ཅིང་རྨོངས་མེད་པ། །
en: Of this there can be no debate or delusion.

source: དེ་སྐད་དེ་བཞིན་གཤེགས་པས་གསུངས། །
en: This is what the Thus-Gone One has taught.

source: གཞོན་ནུ་ལྷོ་ཕྱོགས་ལོགས་ན་གཞོན་ནུ་དཔེ་སྔ་མ་ལྟ་བུ་ལས་ཉིས་གྱུར་གྱི་རྡུལ་ཕྲ་མོའི་རྡུལ་བགྲངས་པའི་ཚུལ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་བཅུ་གཉིས་འདས་པ་ན་དེ་ན་ཟླ་བས་བརྒྱན་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཡོད་དེ
en: “Young man, located in the south, past twelve buddha realms reckoned as twice the number of smallest particles in the previous analogy, there is a world called Adorned by the Moon.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་གི་འོད་ཀྱིས་རྣམ་པར་རོལ་པ་མངོན་པར་མཁྱེན་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ་
en: There resides the thus-gone, worthy, perfect Buddha King of Knowledge of Floral Light Displays.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: He is alive and well and teaches the Dharma.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གི་འོད་ཀྱིས་རྣམ་པར་རོལ་པ་མངོན་པར་མཁྱེན་པ་དེའི་མཚན་ཐོས་ནས་
en: Young man, when those noble sons or daughters who abide in the Bodhisattva Vehicle hear the name of the blessed one, the thus-gone one King of Knowledge of Floral Light Displays—

source: སོམ་ཉི་མི་ཟ་ལ་ངས་མཐོང་བ་ལ་ཡང་ཡིད་ཆེས་ན་དེ་ཚེ་འདས་པའི་འོག་ཏུ་འོད་ཟེར་རབ་ཏུ་གཏོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར།
en: as long as they do not doubt this but trust in my vision—they will achieve the absorption of emitting light rays once they have passed away.

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་ཁྲིར་འཇུག་པ་འཐོབ་པར་འགྱུར།
en: They will become knowledgeable in ten thousand countless trillions of methods to gain absorption.

source: གཟུངས་ཀྱི་སྒོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་དྲུག་ཅུ་པོ་རྒྱ་མཚོ་ལྟ་བུ་ཞེས་བྱ་བའི་གཟུངས་ལ་སོགས་པ་ནས་རིན་པོ་ཆེའི་མཛོད་ཀྱི་གཟུངས་ལ་ཐུག་པའི་བར་ལ་འཇུག་པ་འཐོབ་ཅིང་
en: They will become knowledgeable in sixty countless trillions of dhāraṇī methods—from the oceanic dhāraṇī to the precious treasury dhāraṇī.

source: བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་དེ་དག་ལ་རྨོངས་པར་ཡང་མི་འགྱུར་རོ། །
en: They will be undeluded in this regard until reaching final awakening.

source: འཆི་བའི་དུས་ཀྱི་ཚེ་ཤར་ཕྱོགས་ནས་སངས་རྒྱས་བྱེ་བ་གཤེགས་ནས་ཞལ་སྟོན་པར་མཛད་དེ། ཕྱོགས་ཐམས་ཅད་ནས་ཀྱང་དེ་དང་འདྲའོ། །
en: When they die, ten million buddhas will come from the east and reveal themselves, and the same will occur from all other directions.

source: གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོས་གསུང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་འཛིན་པར་འགྱུར།
en: They will retain the Dharma that these blessed buddhas teach.

source: བྱང་ཆུབ་མ་ཐོབ་ཀྱི་བར་དུ་དེའི་ཆོས་ཀྱི་ཚུལ་དེ་འཇིག་པར་མི་འགྱུར།
en: Until they reach awakening they will not lose this Dharma way.

source: ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནས་བཟུང་ནས་བསྐལ་པ་ལྔ་བརྒྱར་འཁོར་བ་ལས་ཕྱིར་ཕྱོགས་པར་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རེག་པར་འགྱུར་རོ། །
en: Having worked to turn away from cyclic existence for five hundred eons starting from the time they began as bodhisattvas, they will reach unsurpassed and perfect awakening.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then expressed this in verse:

source: མི་ཡི་དབང་པོ་འཇིག་རྟེན་མགོན། །སྐྱོབ་པ་ཡི་ནི་མཚན་ཐོས་པ། །བསྐལ་པ་ལྔ་བརྒྱ་ཐམ་པ་ཡི། །འཁོར་བ་དག་ནི་བཟློག་པར་འགྱུར། །
en: “Hearing the name of this protector, The lord of humans, the world protector, They will eliminate five hundred eons Of cyclic existence.

source: འཆི་བདག་གི་དུས་ཚེ་ཡང་། །སངས་རྒྱས་བྱེ་བ་སྟོན་པར་མཛད། །
en: “When death comes to those noble sons and daughters, Millions of buddhas will appear to them.

source: མཐོང་ནས་དབང་པོས་ཕྱག་འཚལ་ཏེ། །ཆོས་ཀྱང་ཉན་ཅིང་འཛིན་པར་འགྱུར། །
en: Having seen them, paying homage with their faculties, They will listen to the Dharma and retain it.

source: དེ་བཞིན་གཤེགས་པའི་མཚན་ཐོས་པ། །སྤྱད་པ་དམ་པ་སྤྱོད་པ་ན། །དེ་ཡིས་བསྟན་པའི་ཆོས་གང་དག །བསྐལ་པ་བྱེ་བར་ཆུད་མི་གསོན། །
en: “When they hear that thus-gone one’s name And engage in sacred practice, They will not waste the Dharma taught by them— Even for millions of eons.

source: སངས་རྒྱས་ཀྱི་ནི་མཚན་བསྒྲགས་པས། །རིན་ཆེན་ཞེས་བྱའི་ཏིང་ངེ་འཛིན། །སྟོང་ཕྲག་བདུན་ཅུ་དེ་ཚེ་འཐོབ། །
en: “By proclaiming the name of this buddha, They will attain seventy thousand Absorptions known as precious,

source: ཡོན་ཏན་བྱེ་བར་སྒྲོགས་པར་འགྱུར། །
en: And they will proclaim millions of virtues.

source: གང་ཞིག་ཐུབ་པའི་མཚན་འཛིན་པ། །ཏིང་འཛིན་གྲངས་མེད་བྱེ་བ་དང་། །དེ་བཞིན་ས་ཡ་དྲུག་ཅུ་དག །དེ་ལ་ཉེ་བར་གནས་པར་འགྱུར། །
en: “Those who apprehend the name of this sage Will come to abide In countless millions Plus sixty million absorptions.

source: དེ་བས་མཉམ་བཞག་དཔའ་བོ་ཡིས། །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པའི་ཚེ། །སེམས་ཅན་མང་པོ་སྟོང་རྣམས་དག །བྱང་ཆུབ་མཆོག་ལ་འཇོག་པར་བྱེད། །
en: “Thus, when heroes of equilibrium Engage in bodhisattva conduct, They establish many thousands of beings In supreme awakening.

source: བྱང་ཆུབ་མ་རྫོགས་བར་དུ་ནི། །ནམ་ཡང་འདོད་ལ་མི་བསྟེན་ཏེ། །
en: “Until reaching perfect awakening, They will not engage in desirous conduct.

source: སེམས་ཅན་གཞན་ཡང་སངས་རྒྱས་ཀྱི། །མཚན་བསྟན་རྣམས་ནི་ཟློག་པར་བྱེད། །
en: The beings to whom they teach the name of this buddha Will also turn away from desire.

source: གང་ཞིག་སངས་རྒྱས་མཚན་ཐོས་ནས། །སྲོག་ཆགས་ཀུན་ལ་འདི་སྟོན་པ། །ནམས་ཀྱང་མི་ཁོམ་མི་འགྱུར་ཞིང་། །
en: “Those who hear the name of this buddha And teach it to all beings Will never again enter unfree states;

source: དེ་ཡི་དལ་བ་རྙེད་མི་དཀའ། །
en: It will not be hard for them to find leisure.

source: ཤིན་དུ་བཟུང་བ་སངས་རྒྱས་དག །འབྱུང་བ་མཉེས་པར་བྱས་པས་ནི། །
en: “By pleasing the excellent buddhas That appear,

source: ང་ཡི་མི་ཁོམ་གང་བསྟེན་པ། །དེ་དག་ཐམས་ཅད་སྤང་བར་འགྱུར། །
en: They will abandon all the unfree states That I have described.

source: ཇི་ལྟར་འདྲེན་པ་མཁྱེན་པ་བཞིན། །གཞོན་ནུ་གལ་ཏེ་ཁྱོད་ཤེས་ན། །
en: “Young man, if you were to understand What the guide knows,

source: སྟོན་པའི་མཚན་ནི་བཟུང་ནས་སུ། །ཕྱོགས་ཀུན་ཏུ་ནི་རབ་ཏུ་སྒྲོགས། །
en: Once you knew the name of this teacher, You would spread it throughout the ten directions.

source: དེ་བས་གཞོན་ནུ་གཞན་དག་ལ། །མཚན་འདི་རབ་ཏུ་བསྟན་བྱས་ན། །
en: “Thus, young man, If you share this name with others,

source: ཡང་དག་བྱང་ཆུབ་འདི་བཟུང་ཞིང་། །འཇིག་རྟེན་གྱི་ནི་མགོན་དུ་འགྱུར། །
en: You will acquire genuine awakening And become a protector of the world.

source: གང་ཞིག་སངས་རྒྱས་མཚན་ཐོས་ནས། །གཡེང་བ་མེད་པར་འདི་བཟུང་སྟེ། །
en: “Those who hear this buddha’s name, Remember it without distraction,

source: སོང་ནས་གཞན་དག་ལ་སྟོན་པ། །དེ་ནི་བྱང་ཆུབ་མངོན་དུ་བསྲུང་། །
en: And share it with others, Will guard their awakening.

source: གང་ཞིག་མདོ་སྡེ་འདི་ཐོས་ནས། །གཞན་དག་ལ་ནི་རབ་སྟོན་ན། །
en: “Those who hear this discourse And teach it to others

source: ལེགས་པར་གསུངས་པའི་ཆོས་ཀྱི་ཚུལ། །བསྟན་པ་འདི་དག་སྲུང་བར་བྱེད། །
en: Will guard these teachings Of the well-spoken Dharma way.”

source: གཞོན་ནུ་ནུབ་ཕྱོགས་ལོགས་ན་གཞོན་ནུ་དཔེ་སྔ་མ་ལྟ་བུ་དེ་ལས་སུམ་འགྱུར་གྱི་རྡུལ་ཕྲ་མོའི་རྡུལ་བགྲངས་པའི་ཚུལ་གྱིས་དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་འདས་པ་ན།
en: “Young man, located in the west, past worlds numbering three times the number of smallest particles in the previous analogy,

source: འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་བཀྲ་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: there is a world called Citraratna.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་རྒྱས་པ་སཱ་ལའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཞིག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: There the thus-gone, worthy, perfect Buddha King of Blossoming Sal Tree Flowers lives. He is alive and well and teaches the Dharma.

source: གཞོན་ནུ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་རྒྱས་པ་སཱ་ལའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེའི་མཚན་ཐོས་ནས་
en: Young man, when those noble sons or daughters who abide in the Great Vehicle hear the name of the thus-gone one King of Blossoming Sal Tree Flowers—

source: སོམ་ཉི་མི་ཟ་ལ་ངས་མཐོང་བ་ལ་ཡང་ཡིད་ཆེས་ན་དེ་ཚེ་འདས་པའི་དུས་འོག་དུ་ཆོས་ལྔ་འཛིན་པར་འགྱུར་ཏེ
en: as long as they do not doubt this but trust in my vision—they will acquire five qualities once they have passed away.

source: ལྔ་གང་ཞེ་ན།
en: What are these five?

source: ལུས་ཞིག་ནས་སངས་རྒྱས་འབྱུང་བ་དང་།
en: When their bodies are destroyed, buddhas will appear and

source: དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཉིད་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་གཟུངས་ཏེ། དེ་ཡང་སྟོང་འཁྱིལ་བའི་གཟུངས་དང་། བྱང་ཆུབ་ཐོབ་ཀྱི་བར་དུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་འཐོབ་པ་སྟེ།
en: they will attain the position of a universal monarch, the five forms of miraculous abilities, the recall of Dharma teachings, the thousand-swirled dhāraṇī, and the thirty-two marks of a great being until they attain awakening.

source: ཆོས་ལྔ་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: They will achieve these five qualities.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་ཚིགས་སུ་བཅད་པས་བཀའ་སྩལ་པ།
en: The Blessed One then expressed the meaning of this in verse:

source: གང་ཞིག་མི་ཡི་ཁྱུ་མཆོག་སྐྱོབ་པའི་མཚན། །ཐོས་ནས་སོམ་ཉི་མེད་ཅིང་དད་བསྐྱེད་ནས། །
en: “Those who hear the name of this leader of men, this protector, And are faithful, without hesitation,

source: དེ་ཡི་ཆོས་ལྔ་དེ་དག་འཛིན་འགྱུར་ཞིང་། །བྱང་ཆུབ་ཐོབ་པའི་བར་དུ་འཇིག་མི་འགྱུར། །
en: Will acquire these five qualities, Which shall not be lost until they attain awakening.

source: གསེར་གྱི་མདོག་འདྲའི་གཟུགས་དང་ལྡན་འགྱུར་ཞིང་། །
en: “They will gain a golden-colored appearance,

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དམ་མཆོག་མཁས། །བསོད་ནམས་ལྡན་པ་སྲེད་མེད་བུ་འདྲ་ཞིང་། །དམ་ཆོས་འཁོར་ལོ་བར་ཆད་མེད་པར་བསྐོར། །
en: The supreme knowledge of a universal monarch, Merit rivaling that of Nārāyaṇa, And the unceasing turning of the wheel of the sacred Dharma.

source: བསོད་ནམས་ལྡན་པ་བུ་སྟོང་ཡོད་འགྱུར་ཏེ། །
en: “They will be fortunate and have a thousand sons

source: དཔའ་ཞིང་རྟུལ་ཕོད་ཕ་རོལ་ཚོགས་འཇོམས་ལ། །
en: Who are heroic and courageous, capable of defeating their opponents.

source: ཡན་ལག་མཆོག་གི་གཟུགས་ལྡན་མཚན་གྱིས་བརྒྱན། །
en: Adorned with marks, their bodies will have perfect limbs.

source: མཐུ་སྟོབས་ཆེ་བ་རྒྱལ་པོ་གཙོ་ཉིད་འདྲ། །
en: Therefore, their power will resemble that of a supreme ruler.

source: རྒྱལ་པོའི་ཆུང་མ་གཟུགས་བཟང་གཟུགས་མཛེས་པ། །གསེར་གྱི་མདོག་འདྲ་མང་པོ་སྟོང་ཡོད་འགྱུར། །
en: “They will have many thousands of queens Who are fine and beautiful, with golden complexions.

source: ཕྱི་ནས་ཉལ་ཞིང་སྔར་ནི་ལྡང་བྱེད་དེ། །རྒྱལ་པོ་གཙོ་ལ་ནམས་ཀྱང་སྐྱོ་མི་བྱེད། །
en: Going late to bed and rising early, They will never cause their supreme rulers any sorrow.

source: རྒྱལ་ཕྲན་གང་དག་དེ་ཡི་ཡུལ་གནས་ཤིང་། །གང་དག་བློན་པོ་ཁྱིམ་བདག་གཙོ་བོ་ཀུན། །རྒྱལ་པོ་དེ་མཐོང་ནམས་ཀྱང་སྐྱོ་མི་བྱེད། །
en: “The vassals, ministers, and major householders Living in his realm Will never cause the king any grief when they meet.

source: དེ་བས་དེ་ནི་བསོད་ནམས་དམ་མཆོག་ལྡན། །
en: Their merit will even be greater than that.

source: མཁས་མཆོག་ལྷ་རྣམས་ཀྱིས་ཀྱང་ཐུབ་པར་དཀའ། །
en: “Even the crafty gods will find them difficult to match.

source: མི་ཡི་འཇིག་རྟེན་དག་ན་གནོད་སྦྱིན་ཀླུ། །དེ་ཡི་ཡུལ་ན་སེམས་ཅན་གང་གནས་པ། །དེ་ཡིས་ཐམས་ཅད་བྱང་ཆུབ་སྙིང་པོར་འཇོག །
en: All the yakṣas and nāgas living in the human world And all the other beings living in his realm They will establish at the seat of awakening.

source: རྒྱལ་སྲིད་རྒྱས་ཤིང་ཤིན་ཏུ་ལོ་ལེགས་དང་། །དེ་ཡི་རྒྱལ་སྲིད་བདེ་ཞིང་སངས་རྒྱས་འབྱུང་། །
en: “Their dominion will expand and the harvests grow bountiful. Their realm will be happy and buddhas will appear.

source: དེ་དག་ལ་ནི་མཆོད་པ་དམ་པ་བྱེད། །
en: They will perform sacred worship of them.

source: རྒྱལ་པོ་བདག་ཡུལ་ནམས་ཀྱང་སྡང་སེམས་མེད། །
en: The land of the king will be free from malice.

source: སངས་རྒྱས་མཚན་མཆོག་ཐོས་ནས་མཁས་པ་གང་། །སོམ་ཉི་ཟ་ཞིང་མི་དགའ་སུ་ཞིག་ཡོད། །
en: “Even those scholars who hear the perfect name of this buddha, Yet doubt it or become displeased with it,

source: མདོ་སྡེ་དམ་པ་དེ་རིང་ངས་བཤད་པའི། །ཆོས་མཆོག་འདི་ཡིས་དེ་ལ་ཕན་འདོགས་འགྱུར། །
en: Will benefit from the perfect Dharma In the sublime discourse that I have spoken today.

source: གཞན་དུ་གང་གིས་སྔོན་གྱི་རྒྱལ་རྣམས་ཀྱིས། །ཆོས་སྤངས་གྱུར་པའམ་བདུད་ཀྱིས་ཟིན་པའམ། །སེམས་ཅན་སྙིང་པོ་རྒྱལ་བ་མཆོག་དག་ནི། །སྔོན་ཆད་སྤྱོད་ཚེ་ཁྱད་དུ་བསད་མ་གཏོགས། །
en: “However, this is not the case for those who abandoned the Dharma Of previous victors, or those in the grip of demons, Or those who in the past despised The essential beings, the perfect victors.

source: གཞོན་ནུ་གང་ཞིག་རྒྱལ་པོའི་ཕོ་བྲང་དང་། །ལིཙྪ་བཱི་བཀོད་དགའ་བ་འདི་དག་དང་། །ཤཱཀྱ་སེང་གེ་ང་ནི་མ་མཐོང་བ། །དེ་དག་སངས་རྒྱས་མཚན་ཐོས་སོམ་ཉི་ཟ། །
en: “Young man, those who haven’t witnessed the delights Of the royal palace and this realm of the Licchavis And who haven’t seen me Will harbor doubts when they hear the name of this buddha.

source: གཞོན་ནུ་བྱང་ཕྱོགས་ལོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་གཞོན་ནུ་དཔེ་སྔ་མ་ལྟ་བུ་དེ་ལས་སུམ་འགྱུར་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་དྲུག་ཅུ་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་དྲ་བས་གཡོགས་པ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Young man, located in the north, past sixty buddha realms reckoned as thrice the number of smallest particles in the previous analogy, there is a world called Covered with a Jewel Net.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བའི་དཀྱིལ་འཁོར་རྣམ་དག་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: There the thus-gone, worthy, perfect Buddha Pure Moon Disk lives.

source: གཞོན་ནུ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་དཀྱིལ་འཁོར་རྣམ་དག་དེའི་མཚན་ཐོས་ནས་
en: Young man, when those noble sons or daughters who abide in the Great Vehicle hear the name of the thus-gone one Pure Moon Disk

source: སོམ་ཉི་མི་ཟ་ཞིང་ངས་མཐོང་བ་ལ་ཡང་ཡིད་ཆེས་ན་དེའི་ཚེ་འདས་པའི་འོག་ཏུ་རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར། གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་མཐོང་བར་འགྱུར།
en: —as long as they do not doubt this but trust in my vision—they will obtain the absorption called source of jewels and behold as many buddhas as there are grains of sand in the Ganges once they have passed away.

source: དེ་སྙེད་ཀྱི་བསྐལ་པ་བྱེ་བར་འཁོར་བ་ལས་ཕྱིར་ཕྱོགས་པར་འགྱུར།
en: For as many millions of eons, they will turn away from cyclic existence.

source: ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རེག་པར་འགྱུར།
en: Such beginning bodhisattvas will reach unsurpassed and perfect awakening.

source: དབྱངས་སྙན་ལྡན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཀྱང་ཐོབ་པར་འགྱུར།
en: They will also attain the absorption called pleasant melody .

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཡང་འགྱུར་རོ། །
en: They will not turn away from unsurpassed and perfect awakening.

source: བུད་མེད་གང་ལ་ལ་ཞིག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་དཀྱིལ་འཁོར་རྣམ་དག་དེའི་མཚན་ཐོས་ནས་སོམ་ཉི་མི་ཟ་ཞིང་ཐེ་ཚོམ་མི་སྐྱེ་ལ་ངས་མཐོང་བ་ལ་ཡང་ཡིད་ཆེས་ན།
en: “Should women hear the name of the blessed thus-gone one Pure Moon Disk without feeling any hesitation or doubt and with trust in my vision,

source: དེ་ཚེ་འདས་པའི་འོག་ཏུ་བུད་མེད་ཀྱི་དབང་པོ་རྣམ་པར་སྤངས་པར་འགྱུར་ཞིང་སྐྱེས་པའི་དབང་པོ་འཐོབ་པར་འགྱུར།
en: they will abandon their female faculties and gain male faculties once they have passed away.

source: སེམས་ཅན་མང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཇོག་པར་འགྱུར།
en: They will establish many beings in unsurpassed and perfect awakening.

source: གང་ཞིག་རྐང་གཉིས་དམ་པ་དེ་ཡི་མཚན། །ཐོས་ནས་ནམས་ཀྱང་སོམ་ཉི་མི་ཟ་བ། །བསྐལ་པ་བྱེ་བ་གང་གཱའི་བྱེ་མ་སྙེད། །དེས་སྤངས་མྱ་ངན་མེད་པའི་སྐྱེས་པར་འགྱུར། །
en: “Those who hear the name of this sublime human And do not doubt it Will, after as many eons as there are grains of sand in the Ganges, Abandon rebirth and change to a state free from anguish.

source: གང་གཱའི་བྱེ་སྙེད་སངས་རྒྱས་དུ་མ་དག །མཐོང་ནས་དེ་དག་ལ་ནི་མཆོད་པར་བྱེད། །
en: “They will behold and venerate Buddhas as numerous as the sands of the Ganges.

source: དེ་སྙེད་སངས་རྒྱས་དེ་ཡི་ཚེ་གཅིག་གིས། །སངས་རྒྱས་མཆོད་ནས་རྒྱལ་བ་མྱ་ངན་འདའ། །
en: All those buddhas they will venerate In a single life, as the victors pass beyond anguish.

source: བྱང་ཆུབ་དམ་པ་སྤྱོད་མཆོག་སྤྱོད་པ་ན། །གང་གིས་སྐྱེས་བུ་ཁྱུ་མཆོག་མཚན་ཐོས་ནས། །
en: “Those who hear the name of this leader of men As they engage in the perfect actions of sacred awakening

source: ནམས་ཀྱང་སོམ་ཉི་མེད་ཅིང་འཛིན་བྱེད་ན། །དེ་འདྲའི་ཁྱད་པར་དེ་ཡིས་འཐོབ་པར་འགྱུར། །
en: And remember it without ever doubting it Will achieve a similar exalted state.

source: གང་གིས་རྐང་གཉིས་མཚན་མཆོག་གཙོ་བོ་འདི། །ཐོས་ནས་ནམས་ཀྱང་སོམ་ཉི་མི་ཟ་བ། །
en: “Those who hear the name of this supreme human And do not doubt it at all

source: རང་བྱུང་ཡེ་ཤེས་སངས་རྒྱས་ཉིད་འགྱུར་ཞིང་། །མཁས་པས་དབྱངས་སྙན་ཏིང་འཛིན་ཐོབ་པར་འགྱུར། །
en: Shall obtain self-existing wisdom, buddhahood itself, And skillfully attain the absorption called pleasant voice.

source: བྱང་ཆུབ་དམ་པ་སྤྱད་མཆོག་སྤྱོད་པ་ན། །དག་པའི་བདག་ཉིད་སྐྱེས་པའི་དབང་པོ་ཐོབ། །
en: “As they engage in the perfect actions of sacred awakening, They will achieve the faculties of a pure individual.

source: ཡོན་ཏན་ཀུན་དང་ལྡན་ཞིང་མཛེས་པ་སྟེ། །དེ་འདྲའི་ཁྱད་པར་དེ་ཡིས་ཐོབ་པར་འགྱུར། །
en: They will be beautiful and endowed with all qualities— Such distinctions they will attain.

source: ཕྱོགས་རྣམས་ཀུན་ནི་རབ་ཏུ་སྣང་བྱེད་ཅིང་། །ས་ཡ་མཐའ་ཡས་ཞིང་དུ་སོང་ནས་སུ། །འཇིག་རྟེན་སྤྱོད་པ་ཐུབ་པ་ཆེ་མཐོང་ནས། །མྱ་ངན་བྲལ་ཏེ་བྱང་ཆུབ་ཕྱིས་རིག་འགྱུར། །
en: “They will shine in all directions And proceed to countless millions of realms. As they behold the great sage engaging with the world, They will escape anguish and later discover awakening.

source: ཐུབ་དབང་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་ནི། །དེ་ཡི་མཚན་འདིར་ཐོས་ནས་རྫུ་འཕྲུལ་མཆོག །དེ་འདྲའི་ཁྱད་པར་དག་ནི་ཐོབ་པར་འགྱུར། །
en: “Having heard the name Of that great lord, that thus-gone one, They will attain such distinctions as perfect miraculous powers,

source: བྱང་ཆུབ་འདོད་པ་གཞན་ཡང་ཐོབ་པ་ནི། །དྲི་བྲལ་བྱང་ཆུབ་འདུན་པ་བསྐྱེད་ནས་སུ། །རྒྱལ་བའི་མཚན་འདི་གཞན་ལའང་སྒྲོགས་པར་བྱེད། །
en: And also the desire to attain awakening. “Having developed interest in immaculate awakening, They will share the name of the victor with others.

source: ཟླ་བའི་དཀྱིལ་འཁོར་རབ་ཏུ་གསལ་བ་ལྟར། །དེ་ཡི་ཡོན་ཏན་དག་ཀྱང་དེ་འདྲར་འགྱུར། །
en: They will obtain virtues similar to his— As brilliant as the full moon.

source: སེམས་ཅན་མང་པོ་དུ་མ་བསམ་མི་ཁྱབ། །བྱང་ཆུབ་མཆོག་ལ་མཁས་པ་དེ་ཡིས་འཇོག །
en: “Such learned persons will establish Fathomless multitudes of beings in supreme awakening.

source: ཟླ་བ་མཁའ་ལ་གནས་པའི་གཞལ་མེད་ཁང་། །འོད་ཟེར་མང་པོ་བསགས་པས་མཛེས་པ་ལྟར། །
en: Like the chariot of the moon in the sky, They will be beautiful and shine brightly.

source: གང་ཞིག་དེ་བཞིན་གཤེགས་པའི་མཚན་འཛིན་པ། །དེ་ཡི་ལུས་ཀྱང་དེ་འདྲའི་རྣམ་པས་མཛེས། །
en: “Those who remember the name of this victor Will have bodies that are just as beautiful.

source: མཁས་པ་གང་ཞིག་རྒྱལ་བའི་མཚན་ཐོས་ནས། །སོམ་ཉི་ཟ་ཞིང་མི་དགའ་སུ་ཞིག་ཡོད། །
en: Yet some scholars who hear the name of this victor Might doubt it, finding displeasure in it.

source: བྱང་ཆུབ་སྤྱད་མཆོག་དམ་པ་སྤྱོད་པ་ན། །ཆོས་འདི་དག་གིས་དེ་ལ་ཕན་འདོགས་འགྱུར། །
en: “As they engage in the perfect actions of sacred awakening, These teachings will be helpful for them.

source: ཐུབ་པ་ཆེན་པོ་འཇིག་རྟེན་སྤྱོད་མཆོག་པས། །མཁས་པ་དེ་ནི་ཕོངས་པ་མྱོང་མི་འགྱུར། །
en: Due to the supreme great sage who engages with the world, Such scholars will not come to ruin.

source: གཞོན་ནུ་འོག་གི་ཕྱོགས་ན་གཞོན་ནུ་དཔེ་སྔ་མ་ལྟ་བུའི་རྣམ་པ་དེ་བཞིན་དུ་དགུ་བཅུ་རྩ་དགུར་བསྒྱུར་བ་འདས་ནས་འཇིག་རྟེན་གྱི་ཁམས་རྒྱལ་མཚན་མཆོག་གི་བདག་པོ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Young man, located below us, past ninety-nine times the number of particles in the previous analogy, there is a world called Lord of the Supreme Banner.
